{
    "id":  "21a57671-2387-4f98-8c01-f2cd21270169",
    "displayName":  "Block Web Client for Azure Virtual Desktop",
    "createdDateTime":  "2021-08-03T11:42:34.1320247Z",
    "modifiedDateTime":  null,
    "state":  "enabled",
    "sessionControls":  null,
    "conditions":  {
                       "signInRiskLevels":  [

                                            ],
                       "clientAppTypes":  [
                                              "browser"
                                          ],
                       "platforms":  null,
                       "locations":  null,
                       "applications":  {
                                            "includeApplications":  [
                                                                        "9cdead84-a844-4324-93f2-b2e6bb768d07"
                                                                    ],
                                            "excludeApplications":  [

                                                                    ],
                                            "includeUserActions":  [

                                                                   ],
                                            "includeAuthenticationContextClassReferences":  [

                                                                                            ]
                                        },
                       "users":  {
                                     "includeUsers":  [
                                                          "All"
                                                      ],
                                     "excludeUsers":  [

                                                      ],
                                     "includeGroups":  [

                                                       ],
                                     "excludeGroups":  [
                                                           "{{BREAKGLASS_ADMIN_GROUP}}"
                                                       ],
                                     "includeRoles":  [

                                                      ],
                                     "excludeRoles":  [

                                                      ]
                                 }
                   },
    "grantControls":  {
                          "operator":  "OR",
                          "builtInControls":  [
                                                  "block"
                                              ],
                          "customAuthenticationFactors":  [

                                                          ],
                          "termsOfUse":  [

                                         ]
                      }
}
