{
    "id":  "c1b0fb94-0dfc-4f58-aa2a-a22129e6841c",
    "displayName":  "Block access from Windows Phone devices",
    "createdDateTime":  "2021-08-26T12:26:41.6479462Z",
    "modifiedDateTime":  null,
    "state":  "enabled",
    "sessionControls":  null,
    "conditions":  {
                       "signInRiskLevels":  [

                                            ],
                       "clientAppTypes":  [
                                              "all"
                                          ],
                       "locations":  null,
                       "applications":  {
                                            "includeApplications":  [
                                                                        "All"
                                                                    ],
                                            "excludeApplications":  [

                                                                    ],
                                            "includeUserActions":  [

                                                                   ],
                                            "includeAuthenticationContextClassReferences":  [

                                                                                            ]
                                        },
                       "users":  {
                                     "includeUsers":  [
                                                          "All"
                                                      ],
                                     "excludeUsers":  [

                                                      ],
                                     "includeGroups":  [

                                                       ],
                                     "excludeGroups":  [
                                                           "{{BREAKGLASS_ADMIN_GROUP}}"
                                                       ],
                                     "includeRoles":  [

                                                      ],
                                     "excludeRoles":  [

                                                      ]
                                 },
                       "platforms":  {
                                         "includePlatforms":  [
                                                                  "windowsPhone"
                                                              ],
                                         "excludePlatforms":  [

                                                              ]
                                     }
                   },
    "grantControls":  {
                          "operator":  "OR",
                          "builtInControls":  [
                                                  "block"
                                              ],
                          "customAuthenticationFactors":  [

                                                          ],
                          "termsOfUse":  [

                                         ]
                      }
}
